; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	thermograph1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 125)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 157)
	(= (data Star4 infrared2) 211)
	(= (data Phenomenon5 infrared2) 135)
	(= (data Planet6 infrared2) 70)
	(= (data Star7 infrared2) 117)
	(= (data Phenomenon8 infrared2) 253)
	(= (data Star9 infrared2) 28)
	(= (data Star10 infrared2) 245)
	(= (data Star4 thermograph1) 234)
	(= (data Phenomenon5 thermograph1) 205)
	(= (data Planet6 thermograph1) 277)
	(= (data Star7 thermograph1) 240)
	(= (data Phenomenon8 thermograph1) 216)
	(= (data Star9 thermograph1) 144)
	(= (data Star10 thermograph1) 261)
	(= (data Star4 spectrograph0) 142)
	(= (data Phenomenon5 spectrograph0) 38)
	(= (data Planet6 spectrograph0) 280)
	(= (data Star7 spectrograph0) 263)
	(= (data Phenomenon8 spectrograph0) 171)
	(= (data Star9 spectrograph0) 125)
	(= (data Star10 spectrograph0) 186)
	(= (slew_time Star3 GroundStation0) 3.192)
	(= (slew_time GroundStation0 Star3) 3.192)
	(= (slew_time Star3 Star1) 73.97)
	(= (slew_time Star1 Star3) 73.97)
	(= (slew_time Star3 GroundStation2) 21.86)
	(= (slew_time GroundStation2 Star3) 21.86)
	(= (slew_time Star1 GroundStation0) 57.29)
	(= (slew_time GroundStation0 Star1) 57.29)
	(= (slew_time GroundStation2 GroundStation0) 22.98)
	(= (slew_time GroundStation0 GroundStation2) 22.98)
	(= (slew_time GroundStation2 Star1) 26.5)
	(= (slew_time Star1 GroundStation2) 26.5)
	(= (slew_time Star4 GroundStation0) 27)
	(= (slew_time GroundStation0 Star4) 27)
	(= (slew_time Star4 Star1) 10.24)
	(= (slew_time Star1 Star4) 10.24)
	(= (slew_time Star4 GroundStation2) 40.34)
	(= (slew_time GroundStation2 Star4) 40.34)
	(= (slew_time Star4 Star3) 37.86)
	(= (slew_time Star3 Star4) 37.86)
	(= (slew_time Phenomenon5 GroundStation0) 21.97)
	(= (slew_time GroundStation0 Phenomenon5) 21.97)
	(= (slew_time Phenomenon5 Star1) 2.973)
	(= (slew_time Star1 Phenomenon5) 2.973)
	(= (slew_time Phenomenon5 GroundStation2) 72.72)
	(= (slew_time GroundStation2 Phenomenon5) 72.72)
	(= (slew_time Phenomenon5 Star3) 39.47)
	(= (slew_time Star3 Phenomenon5) 39.47)
	(= (slew_time Phenomenon5 Star4) 73.04)
	(= (slew_time Star4 Phenomenon5) 73.04)
	(= (slew_time Planet6 GroundStation0) 28.97)
	(= (slew_time GroundStation0 Planet6) 28.97)
	(= (slew_time Planet6 Star1) 3.729)
	(= (slew_time Star1 Planet6) 3.729)
	(= (slew_time Planet6 GroundStation2) 36.09)
	(= (slew_time GroundStation2 Planet6) 36.09)
	(= (slew_time Planet6 Star3) 10.82)
	(= (slew_time Star3 Planet6) 10.82)
	(= (slew_time Planet6 Star4) 43.72)
	(= (slew_time Star4 Planet6) 43.72)
	(= (slew_time Planet6 Phenomenon5) 36.08)
	(= (slew_time Phenomenon5 Planet6) 36.08)
	(= (slew_time Star7 GroundStation0) 49.99)
	(= (slew_time GroundStation0 Star7) 49.99)
	(= (slew_time Star7 Star1) 59.15)
	(= (slew_time Star1 Star7) 59.15)
	(= (slew_time Star7 GroundStation2) 13.09)
	(= (slew_time GroundStation2 Star7) 13.09)
	(= (slew_time Star7 Star3) 29.96)
	(= (slew_time Star3 Star7) 29.96)
	(= (slew_time Star7 Star4) 27.03)
	(= (slew_time Star4 Star7) 27.03)
	(= (slew_time Star7 Phenomenon5) 13.84)
	(= (slew_time Phenomenon5 Star7) 13.84)
	(= (slew_time Star7 Planet6) 14.62)
	(= (slew_time Planet6 Star7) 14.62)
	(= (slew_time Phenomenon8 GroundStation0) 52.72)
	(= (slew_time GroundStation0 Phenomenon8) 52.72)
	(= (slew_time Phenomenon8 Star1) 39.86)
	(= (slew_time Star1 Phenomenon8) 39.86)
	(= (slew_time Phenomenon8 GroundStation2) 3.104)
	(= (slew_time GroundStation2 Phenomenon8) 3.104)
	(= (slew_time Phenomenon8 Star3) 8.401)
	(= (slew_time Star3 Phenomenon8) 8.401)
	(= (slew_time Phenomenon8 Star4) 35.78)
	(= (slew_time Star4 Phenomenon8) 35.78)
	(= (slew_time Phenomenon8 Phenomenon5) 54.3)
	(= (slew_time Phenomenon5 Phenomenon8) 54.3)
	(= (slew_time Phenomenon8 Planet6) 20.49)
	(= (slew_time Planet6 Phenomenon8) 20.49)
	(= (slew_time Phenomenon8 Star7) 19.29)
	(= (slew_time Star7 Phenomenon8) 19.29)
	(= (slew_time Star9 GroundStation0) 32.48)
	(= (slew_time GroundStation0 Star9) 32.48)
	(= (slew_time Star9 Star1) 43.87)
	(= (slew_time Star1 Star9) 43.87)
	(= (slew_time Star9 GroundStation2) 52.73)
	(= (slew_time GroundStation2 Star9) 52.73)
	(= (slew_time Star9 Star3) 56.99)
	(= (slew_time Star3 Star9) 56.99)
	(= (slew_time Star9 Star4) 4.158)
	(= (slew_time Star4 Star9) 4.158)
	(= (slew_time Star9 Phenomenon5) 59.95)
	(= (slew_time Phenomenon5 Star9) 59.95)
	(= (slew_time Star9 Planet6) 64.97)
	(= (slew_time Planet6 Star9) 64.97)
	(= (slew_time Star9 Star7) 17.99)
	(= (slew_time Star7 Star9) 17.99)
	(= (slew_time Star9 Phenomenon8) 19.34)
	(= (slew_time Phenomenon8 Star9) 19.34)
	(= (slew_time Star10 GroundStation0) 34.99)
	(= (slew_time GroundStation0 Star10) 34.99)
	(= (slew_time Star10 Star1) 10.02)
	(= (slew_time Star1 Star10) 10.02)
	(= (slew_time Star10 GroundStation2) 55.81)
	(= (slew_time GroundStation2 Star10) 55.81)
	(= (slew_time Star10 Star3) 17.51)
	(= (slew_time Star3 Star10) 17.51)
	(= (slew_time Star10 Star4) 1.009)
	(= (slew_time Star4 Star10) 1.009)
	(= (slew_time Star10 Phenomenon5) 57.91)
	(= (slew_time Phenomenon5 Star10) 57.91)
	(= (slew_time Star10 Planet6) 55.52)
	(= (slew_time Planet6 Star10) 55.52)
	(= (slew_time Star10 Star7) 43.4)
	(= (slew_time Star7 Star10) 43.4)
	(= (slew_time Star10 Phenomenon8) 17.67)
	(= (slew_time Phenomenon8 Star10) 17.67)
	(= (slew_time Star10 Star9) 82.37)
	(= (slew_time Star9 Star10) 82.37)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Star4)
	(have_image Phenomenon5 spectrograph0)
	(have_image Planet6 spectrograph0)
	(have_image Star7 spectrograph0)
	(have_image Phenomenon8 infrared2)
	(have_image Star10 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 157 to 84.28, (fuel-used) from 0 to 72.72
   goals met: 0 of 6
2. (turn_to satellite0 star10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 125 to 114.98, (fuel-used) from 72.72 to 82.74
   goals met: 0 of 6
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 114.98 to 104.96, (fuel-used) from 82.74 to 92.76
   goals met: 0 of 6
5. (turn_to satellite0 star10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 104.96 to 94.94, (fuel-used) from 92.76 to 102.78
   goals met: 0 of 6
6. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 94.94 to 84.92, (fuel-used) from 102.78 to 112.8
   goals met: 0 of 6
7. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 6
8. (turn_to satellite0 phenomenon8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 84.92 to 45.06, (fuel-used) from 112.8 to 152.66
   goals met: 0 of 6
9. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 45.06 to 41.956, (fuel-used) from 152.66 to 155.764
   goals met: 0 of 6
10. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 41.956 to 38.852, (fuel-used) from 155.764 to 158.868
   goals met: 0 of 6
11. (take_image satellite0 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   changed: (data_capacity satellite0) from 1000 to 747, (data-stored) from 0 to 253
   goals met: 1 of 6
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 6
14. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 38.852 to 35.748, (fuel-used) from 158.868 to 161.972
   goals met: 1 of 6
15. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 35.748 to 32.644, (fuel-used) from 161.972 to 165.076
   goals met: 1 of 6
16. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 32.644 to 29.54, (fuel-used) from 165.076 to 168.18
   goals met: 1 of 6
17. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
18. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 6
19. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 29.54 to 26.436, (fuel-used) from 168.18 to 171.284
   goals met: 1 of 6
20. (turn_to satellite0 star10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 26.436 to 8.766, (fuel-used) from 171.284 to 188.954
   goals met: 1 of 6
21. (turn_to satellite1 star1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 84.28 to 81.307, (fuel-used) from 188.954 to 191.927
   goals met: 1 of 6
22. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 81.307 to 77.578, (fuel-used) from 191.927 to 195.656
   goals met: 1 of 6
23. (turn_to satellite1 star7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 77.578 to 62.958, (fuel-used) from 195.656 to 210.276
   goals met: 1 of 6
24. (turn_to satellite1 groundstation2 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 62.958 to 49.868, (fuel-used) from 210.276 to 223.366
   goals met: 1 of 6
25. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 1 of 6
26. (turn_to satellite1 star7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 49.868 to 36.778, (fuel-used) from 223.366 to 236.456
   goals met: 1 of 6
27. (take_image satellite1 star7 instrument2 spectrograph0)
   added: (have_image star7 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 737, (data-stored) from 253 to 516
   goals met: 2 of 6
28. (turn_to satellite1 phenomenon5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 36.778 to 22.938, (fuel-used) from 236.456 to 250.296
   goals met: 2 of 6
29. (take_image satellite1 phenomenon5 instrument2 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   changed: (data_capacity satellite1) from 737 to 699, (data-stored) from 516 to 554
   goals met: 3 of 6
30. (turn_to satellite1 star1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 22.938 to 19.965, (fuel-used) from 250.296 to 253.269
   goals met: 3 of 6
31. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 19.965 to 16.236, (fuel-used) from 253.269 to 256.998
   goals met: 3 of 6
32. (take_image satellite1 planet6 instrument2 spectrograph0)
   added: (have_image planet6 spectrograph0)
   changed: (data_capacity satellite1) from 699 to 419, (data-stored) from 554 to 834
   goals met: 4 of 6
33. (turn_to satellite1 star1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 16.236 to 12.507, (fuel-used) from 256.998 to 260.727
   goals met: 4 of 6
34. (turn_to satellite1 star4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 12.507 to 2.267, (fuel-used) from 260.727 to 270.967
   goals met: 5 of 6
35. (take_image satellite0 star10 instrument0 thermograph1)
   added: (have_image star10 thermograph1)
   changed: (data_capacity satellite0) from 747 to 486, (data-stored) from 834 to 1095
   goals met: 6 of 6
